using Ballistics

a = cal_ballistics(
        d = 7.62 * 10.0 ^ -3, # калибр, м
        S = 47.99 * 10.0 ^ -6, # м2
        l_д = 0.62 - 52.07 * 10 ^ -3,
        ω = 3.25 * 10.0 ^ -3, # кг
        q = 9.6 * 10.0 ^ -3, # кг
        W_км = 3.76 * 10.0 ^ -6, # м3

        # Параметры пороха
        f=1.05 * 10.0 ^ 6,
        α_k=0.95 * 10.0 ^ -3,
        k=1.2,
        z_k=1,
        κ=1.173,
        λ=-0.145,
        δ=1.6,
        I_k=0.245 * 10.0 ^ 6,
        T_1=2873,
        K_f=0.0003,
        K_I=0.0016,

        T = 273 + 15, #

        K = 1.03, # коэффициент учета второстепенных работ

        σ_T = 360, # постоянная коэффициента теплоотдачи
        ν_T = 0.7, # относительная разность температур газа и стенки

        p_всп = 5 * 10.0 ^ 6, # Давление вспышки, МПа
        p_0 = 10 * 10.0 ^ 6, # Давление форсирования, МПа
)

print(a)